custom_models/wedge_flow/Oldroyd-BLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform ( 0.01 0 0 );
    }

    outlet
    {
        type            zeroGradient;
        //type           fixedValue;
        //value          uniform ( 1 0 0 );
    }

    walls
    {
    	type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    
    front
    {
        type           wedge;
    }
    back
    {
    	type		wedge;
    }
}

// ************************************************************************* //
