custom_models/wedge_flow/Oldroyd-BLog/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    outlet
    {
        type            zeroGradient;
        //type            fixedValue;
        //value           uniform (0 0 0 0 0 0);
    }

   walls
    {
    	type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    
    front
    {
        type           wedge;
    }
    back
    {
    	type		wedge;
    }
}

// ************************************************************************* //
